Revit 2026 API

# NurbsSurfaceDataGetWeight Method

---

Get the weight.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double GetWeight(
	int idx
)
```
```vb
Public Function GetWeight (
	idx As Integer
) As Double
```
```cpp
public:
double GetWeight(
	int idx
)
```
```fsharp
member GetWeight :
        idx : int -> float
```

#### Parameters

idx Int32
     The index of the weight.

#### Return Value

Double

| Exception | Condition |
| --- | --- |
| ArgumentException | Out-of-range access. |

#### Reference

NurbsSurfaceData Class

Autodesk.Revit.DB Namespace